{"text": ["Publications | The Protect Heritage Corp.", "\r\n", "\r\n", "Home", "About", "GIVING BACK", "Blog", "Events", "Events", "Past Clients", "Contact", "Resources", "Resources", "Publications", "eBook download", "Humour", "http://aic.stanford.edu/jaic/articles/jaic44-03-007_indx.html", "http://opensi.si.edu/index.php/smithsonian/catalog/book/111", "https://link.springer.com/chapter/10.1007/978-1-4020-9026-4_10", "http://protectheritage.com/blog/ebook-download/", "http://www.museum-sos.org/docs/WallerSPNHC1995.pdf", "https://www.academia.edu/8908157/Improving_risk_assessment_methods_in_a_complex_setting_Museum_Victoria_s_Collection_Risk_Assessment", "http://www.konservaattoriliitto.fi/060513/Offprint%204.pdf", "http://www.museum-sos.org/docs/WallerICOMCC2002.pdf", "http://www.konservaattoriliitto.fi/060513/Offprint%203.pd", "http://www.museum-sos.org/docs/WallerAIC1996.pdf", "http://www.konservaattoriliitto.fi/060513/Offprint%201.pdf", "http://www.museum-sos.org/docs/WallerOttawa1994.pdf", "http://artconservation.buffalostate.edu/sites/artconservation.buffalostate.edu/files/uploads/LACEsurvey.pdf", "http://www.getty.edu/conservation/publications/newsletters/19_1/feature.html", "\r\nAssessing risks to your collections", "\r\nLeipzig November 10, 2018", "The Protect Heritage Corp. - Bridging Past and Future", "Home", "About", "\n", "\n\t", "GIVING BACK", "\n", "\n", "Blog", "Events", "\n", "\n\t", "Events", "\n\t", "Past Clients", "\n", "\n", "Contact", "Resources", "\n", "\n\t", "Resources", "\n\t", "Publications", "\n\t", "eBook download", "\n\t", "Humour", "\n", "\n", "Danielle Measday, Alice Cannon and Robert Waller. Risk under the microscope: risk management for Museum Victoria’s scientific slide collection. ", "Collection Forum", " (in press)", "Jane Henderson and Robert Waller. 2016. Effective conservation decision strategies. ", "Studies in Conservation", " ", "61", "(6): 308-323.", "Robert Waller. 2013.The state of the art in cultural property risk analysis: Reflections on the Lisbon 2011 International Symposium and Workshop on Cultural Property Risk.  ", "Collection Forum", " ", "27", "(1-2):18–25.", "Catharine Hawks and Robert Waller. 2013. A Tale of Two Systems: Synergy in Managing Risks to People and to Collections. ", "Collections", " ", "9", "(1):115–124.", "Jude Southward, Heather Thorwald, Garnet Muething and Robert Waller.  2013. Collections risk assessment at the Denver Museum of Nature & Science. ", "Collections", " ", "9", "(1):71-92.", "Antomarchi, A. Brokerhof, S. Michalski, I. Verger and R. Waller. 2005. Teaching risk assessment of collections internationally. ", "Collections", " ", "2", "(2): 117-140.", "Muething, R. Waller and F. Graham. 2005. Risk Assessment of Collections in Exhibitions at the Canadian Museum of Nature. ", "Journal of the American Institute for Conservation", ". ", "44", "(3):233-243. ", "http://aic.stanford.edu/jaic/articles/jaic44-03-007_indx.html", "Robert Waller and John E. Simmons. 2003. An exploratory assessment of the state of a fluid-preserved herpetological collection.  ", "Collection Forum", " ", "18", "(1-2) 1-37,", "Robert Waller, K. Andrew and J Tétreault. 2000. Survey of gaseous pollutant concentration distributions in mineral collections. ", "Collection Forum", " ", "14", "(1-2) 1-32,", "Robert Waller and N. Boase. 1993. The effect of propylene glycol on ethanol concentrations determined by density measurement. ", "Collection Forum", " ", "10", "(2), 41-49.", "Robert Waller, K. Andrew and J. Tétreault. 1993. A survey of pollutant concentrations in mineral collection cabinets. ", "SSCR Journal", " ", "4", "(1) 13‑15.", "Robert Waller and Tom Strang. 1996. Physical-chemical properties of preservative solutions I: Ethanol-water solutions. ", "Collection Forum", " ", "12", "(2), 70-85.", "Robert Waller, R.A. Stairs and T. Miller. 1992. Improving the selectivity of a selective chemical dissolution process: A solution for removing calcite from apatite. ", "Collection Forum", " ", "8", "(1), 22‑34.", "Robert Waller. 1991. Correct use of the terms stable, metastable, and unstable.  ", "The Geological Curator", " ", "5", "(6), 245‑246.", "Robert Waller. A view of ethical conservation and mineral specimen falsification.  ", "The Geological Curator", " 4(7), 433‑437, 1987.", "Robert Waller and D.E. McAllister. 1986. A spot test for distinguishing formalin from alcohol solutions. Pp. 93‑99 in: J. Waddington and D.M. Rudkin, Eds. ", "Proceedings of the 1985 Workshop on the Care and Maintenance of Natural History Collections. a", "nd ", "Curator", " ", "30", "(3), 240‑249, 1987.", "Robert Waller, F. Hartwick, S. Marcil and M. Walker. 1986. A wet‑peening adapter for air‑abrasive machines. ", "Journal of the International Institute for Conservation ‑ Canadian Group", " ", "10&11", ": 31‑33.", "Robert Waller. 1984. Vacuum impregnation of fractured geological specimens. ", "Curator", " ", "27", "(1), 23‑31,", "J.D. Grice, R.A. Gault and R. Waller. Spinel from Glencoe Island, Northwest Territories, Canada.  ", "Rocks and Minerals", " ", "57", "(4), 155‑157, 1982.", "R.A. Gault and R. Waller. 1980.Uraninite from Gatineau Park, Quebec.  ", "Mineralogical Record", " ", "11", ", 79‑81.", "Robert Waller. 1984. Vacuum impregnation of fractured geological specimens. ", "Curator", " ", "27", "(1), 23‑31,", "J.D. Grice, R.A. Gault and R. Waller. Spinel from Glencoe Island, Northwest Territories, Canada.  ", "Rocks and Minerals", " ", "57", "(4), 155‑157, 1982.", "R.A. Gault and R. Waller. 1980.Uraninite from Gatineau Park, Quebec.  ", "Mineralogical Record", " ", "11", ", 79‑81.", "Robert Waller. 2016. Risk Assessment and Assignment of Environment Parameters. Pp. 33-41 in: S. Stauderman and W. G. Tompkins (eds.) ", "Summit on the Museum Preservation Environment", ". Smithsonian Institution Scholarly Press. Washington. Available at: ", "http://opensi.si.edu/index.php/smithsonian/catalog/book/111", "Robert Waller. 2008. Comprehensive risk assessment: Applying the cultural property risk analysis model to the Canadian Museum of Nature.  In: ", "NATO Science for Peace and Security Series-C: Environmental Security: Real Time and Deliberative Decision Making", ". I. Linkov, E. Ferguson, and V.S. Magar (Eds.) pp. 179-190. ", "https://link.springer.com/chapter/10.1007/978-1-4020-9026-4_10", "Robert Waller, 2004. Know thine enemy: be it fire, pestilence, rot or other.  Invited essay in Merritt, E. (Ed.) ", "Covering Your Assets: Facilities and Risk Management in Museums", ". American Association of Museums. p.p. 46-48.", "Robert Waller. ", "Cultural Property Risk Analysis Model: Development and Application to Preventive Conservation at the Canadian Museum of Nature", ".  Göteborg Studies in Conservation 13, ISSN 0284-6578; ISBN 91-7346-475-9 Göteborg Acta Universitatis Gothoburgensis, Göteborg; 2003.  xvi + 189 p.p. Available for download at: ", "http://protectheritage.com/blog/ebook-download/", "Robert Waller. 2001. Salvage of mineralogical collections and specimens.  Pp. 187-190 in: Ball, Cynthia and Audrey Yardley-Jones (Eds.) ", "HELP!! A Survivor", "’", "s Guide to Emergency Preparedness", ". Edmonton: Museums Alberta.", "Paisley S. Cato, Robert Waller, Llyn Sharp, John Simmons and Stephen L. Williams. 1996. ", "Developing Staff Resources for Managing Collections", ". Martinsville: Virginia Museum of Natural History.", "Robert Waller. 1995. Risk Management Applied to Preventive Conservation.  pp 21-28 In: Rose, C.L., Hawks, C.A. and Genoways, H.H. (eds.).  ", "Storage of Natural History Collections: A Preventive Conservation Approach", ". Iowa City: Society for the Preservation of Natural History Collections.", "\n", "http://www.museum-sos.org/docs/WallerSPNHC1995.pdf", "Robert Waller. 1992. Temperature and humidity sensitive mineralogical and petrological specimens. pp. 25‑50 in: F. Howie (ed.) ", "Care and Conservation of Geological Material: Minerals, Meteorites and Lunar Finds", ". London: Butterworth‑Heinemann.", "Alice Cannon, Helen Privett, Maryanne McCubbin, and Robert Waller. 2017. Towards the ‘collectively subjective’: the challenges of estimating loss in value during collection risk assessments. International Council of Museums, Committee for Conservation, 18", "th", " Triennial Meeting, Copenhagen, 2017.", "MaryAnn McCubbin, et al and Robert Waller. Improving risk assessment methods in a complex setting: Museum Victoria’s Collection Risk Assessment. International Council of Museums, Committee for Conservation, 17", "th", " Triennial Meeting, Melbourne, 2014. ", "https://www.academia.edu/8908157/Improving_risk_assessment_methods_in_a_complex_setting_Museum_Victoria_s_Collection_Risk_Assessment", "Lisa Elkin, Dieter Fenkart-Fröschl, Elizabeth Nunan, and Robert Waller. 2011. A database tool for collections risk evaluation and planning. International Council of Museums, Committee for Conservation, 16", "th", " Triennial Meeting, Lisbon, pp. 1-12.", "Robert Waller 2008. Cultural property risk assessment: matching approach with purpose.  International Council of Museums, Committee for Conservation, Preprints of the 15", "th", " Triennial Meeting, New Delhi. Volume 2 pp. 815-819.", "Season Tse and Robert Waller 2008. Developing a Risk Assessment Model for Iron Gall Ink on Paper.  International Council of Museums, Committee for Conservation, Preprints of the 15", "th", " Triennial Meeting, New Delhi. Vol.1 pp. 301-309.", "Brokerhof, A., S. Michalski, J.L. Pedersoli, Jr., R. Waller. 2007. Interfacing research and risk management for a better safeguarding of cultural heritage, In: Proceedings of the 7th European Conference “SAUVEUR” Safeguarded Cultural Heritage – Understanding & Viability for the Enlarged Europe, 31st May – 3rd June, 2006, Prague, M. Drdácký and M. Chapuis (eds.), ITAM – ARCCHIP, Prague, Volume 2 – Posters, pp. 1030-1033.", "Season Tse and Robert Waller. 2006. Proposed Risk Model and Survey Form for Iron Gall Ink Containing Paper Objects and Collection. Second Iron Gall Ink Meeting and Final Meeting for Metals in Paper European Thematic Network, January 24-27, 2006, Newcastle upon Tyne, UK, Conference Poster and Pre Conference publication. pp.107-108", "Robert Waller and S. Michalski. 2005 .A Paradigm Shift for Preventive Conservation, and a Software Tool to Facilitate the Transition.  International Council of Museums, Committee for Conservation, Preprints of the 14", "th", " Triennial Meeting, The Hague. p.p. 733-738.", "Brokerhof, T. Luger, B. Ankersmit, F. Bergevoet, R. Schillemans, P. Schoutens, T. Muller, J. Kiers, G. Muething and R. Waller. 2005. Risk Assessment of Museum Amstelkring: Application to an historic building and its collections and the consequences for preservation management.  Submitted to: International Council of Museums, Committee for Conservation, Preprints of the 14", "th", " Triennial Meeting, The Hague.  p.p. 590-596.", "Robert Waller, 2005. Seeking balanced risk mitigation: Risk assessment at the Canadian Museum of Nature.  Pp. 129-136 in: J. Wellheiser and N. Gwinn (Eds.) Proceedings of the IFLA Berlin 2003 Preconference: Preparing for the Worst, Planning for the Best: Protecting our Cultural Heritage from Disaster.  K.G. Saur, München 192p.p. (IFLA Publications; 111) ISBN 3-598-21842-7.", "Robert Waller, 2004. Commitment to Effective Preservation: A risk-based approach to the conservation of cultural property. The Best in Heritage 2004 Conference Program, European Heritage Association, Zagreb; p.16-17.", "Robert Waller. 2002. A risk model for collection preservation.  International Council of Museums, Committee for Conservation, Preprints of the 13", "th", " Triennial Meeting, Rio de Janeiro, 2002, pp. 102‑107. Copy can be found at: ", "http://www.konservaattoriliitto.fi/060513/Offprint%204.pdf", " or ", "http://www.museum-sos.org/docs/WallerICOMCC2002.pdf", "Robert Waller. 1999. Internal pollutants, risk assessment and conservation priorities. International Council of Museums, Committee for Conservation, Preprints of the 12", "th", " Triennial Meeting, Lyon, 1999, pp. 113‑118.  Copy can be found at: ", "http://www.konservaattoriliitto.fi/060513/Offprint%203.pd", "f", "Cato, P. S., R. Waller, L. Sharp, J. E. Simmons, and S. L. Williams. 1998. Training strategies for staff members with responsibilities for managing collections. Pp. 110-116, in 1996 Proceedings of the ICOM Committee for the Training of Personnel. Museum, Catalysts for Community Development. Museum of Texas Tech University, Lubbock, Texas, 152 pp.", "Robert Waller. 1996. Preventive conservation planning for large and diverse collections.  Preservation of Collections: Assessment, Evaluation, and Mitigation Strategies. Preprints of the June 10-11, 1996 workshop, American Institute for Conservation, Washington, p. 1-9, 1996.", "\n", "http://www.museum-sos.org/docs/WallerAIC1996.pdf", "Robert Waller. 1994. Conservation risk assessment: A strategy for managing resources for preventive conservation.  Preprints of the Contributions to the Ottawa Congress, 12‑16 September 1994, Preventive Conservation: Practice, Theory and Research, A. Roy and P. Smith (Eds.), IIC, London, pp. 12‑16.  Copy can be found at: ", "http://www.konservaattoriliitto.fi/060513/Offprint%201.pdf", " or ", "http://www.museum-sos.org/docs/WallerOttawa1994.pdf", "with others as SPNHC‑CC Assessment Subcommittee. 1990. Defining standard procedures for assessing the condition of a fluid‑preserved collection. International Council of Museums, Committee for Conservation, Preprints of the Ninth Triennial Meeting, Dresden, 1990, pp. 437‑440.", "Robert Waller. 1987. An experimental ammonia gas treatment method for oxidized pyritic mineral specimens.  International Council of Museums, Committee for Conservation, Preprints of the Eighth Triennial Meeting, Sidney, 625‑630.", "Robert Waller. 1984. The prevention of deliquescence, efflorescence and hydration in mineral specimens.  International Council of Museums, Committee for Conservation, Preprints of the Seventh Triennial Meeting, Copenhagen, pp. 84.13.8‑84.13.10.", "Robert Waller. 1980. The preservation of mineral specimens.  Preprints, The American Institute for Conservation of Historic and Artistic Works, eighth annual Meeting, San Francisco, 116‑128.", "Robert Waller and Tessa Thomas. 2016. ", "Library and Archives Conservation Education Survey: Report of Results", ". 88 pp. Available at: ", "http://artconservation.buffalostate.edu/sites/artconservation.buffalostate.edu/files/uploads/LACEsurvey.pdf", "Robert Waller and Stefan Michalski.  2004. Effective Preservation: From Reaction to Prevention. Getty Conservation Institute Newsletter ", "19", "(1): 4-9.", "\n", "http://www.getty.edu/conservation/publications/newsletters/19_1/feature.html", "Robert Waller. 1999. Incorrect temperature as a risk – how significant is it? ", "Natural Sciences Conservation Newsletter", " Issue 10, ‘Ten Agents of Deterioration’ Insert No. 5/6 ‘Temperature & Relative Humidity’, pp. 16-21,", "Robert Waller. 1992. Polyethylene foam inserts for specimen trays.  pp. 19‑20 in: C.L. Rose and A. R. de Torres (eds.)  ", "Storage of Natural History Collections: Ideas and Practical Solutions.", "  Society for the Preservation of Natural History Collections.", "Robert Waller. 1989. Pyrite oxidation studies. Canadian Conservation Institute Newsletter, p. 10.  Winter/Spring.", "Robert Waller. 1980. A rust removal method for mineral specimens.  ", "Mineralogical Record", " ", "11", ", 109‑110.", "The Protect Heritage Corp. - Bridging Past and Future", "", "The Protect Heritage Corp.", "width=device-width, initial-scale=1, maximum-scale=1", "WordPress 5.6.3", "Think-Press Favicon Generator v1.5"]}