{
    "title": [
        "Purposeful Investing | Legacy Bridge Private Family Offices"
    ],
    "text": [
        "\r\n\t       \t    \t",
        "\r\n                ",
        "Home",
        "About us",
        "Approach",
        "Family Office",
        "Purposeful Investing",
        "Contact us",
        "Client Login",
        "Managed Accounts Reporting",
        "READ MORE  »",
        "Sneak peek into the process  »",
        "see our strategy at work  »",
        "Learn more about custom reporting  »",
        "Family Office",
        "Request Meeting",
        "Meet The Team",
        "Client Relationship Summary",
        "Disclosures",
        "Legal Terms and Conditions",
        "When you live your life purposefully, the places you go, the things you do and the people you spend time with, are meaningful. Together, they support your passions, contribute to your wellbeing and enhance your legacy.",
        "We believe your investments should be purposeful as well, advancing your life’s work and furthering your personal pursuits. That’s why we work with you to fully understand your family and your financial situation through our Discovery phase. Then, we develop an investment strategy purposefully driven by your goals and implemented through our Investment Process. And finally, we meet with you regularly to provide insight into your assets with valuable Customized Reporting.",
        "With purpose there is direction. With Legacy Bridge there is Purposeful Investing.",
        "Individual assets and investments are the tools we use to build your portfolio. Each asset type has a primary and secondary purpose, whether it’s to provide income or principal growth, or to hedge a risk characteristic of a different asset type.",
        "We’ll construct your portfolio by blending individual investments selected purposefully from the four asset classes in proportional allocations intended to meet your objectives at the lowest possible risk available. Within each asset class we employ a management type aimed at capturing the purposes assigned to that specific area.",
        "Discovery is the most important step in our investment process. Through a comprehensive discussion with you about your goals and the requirements of the assets, we’ll gain an in-depth understanding of your needs. We’ll also ascertain your level of acceptance for volatility along with the actual need for that volatility. This gives purpose to the design of the portfolio and, in turn, purpose to the portfolio.",
        "With Purposeful Investing, each and every asset must meet a defined objective. In addition, each asset must stand alone as a viable investment while working toward the overall strategy of the Investment Policy Statement.",
        "The final step of Purposeful Investing is continuous Client-Focused Reporting. This is where you see the direct relationship between your distinct goals and your asset base through clear and comprehensive reports.",
        "Home",
        "About us",
        "Approach",
        "Family Office",
        "Purposeful Investing",
        "Contact us",
        "Client Login",
        "text/html; charset=UTF-8",
        "IE=edge,chrome=1",
        "width=device-width, initial-scale=1.0",
        "WordPress 5.6.1"
    ]
}
