{"text": ["Transitional Care Gets a Room of Its Own - Patient Safety & Quality Healthcare", "\n\t\t\n\t\t\t\t\t", "\n\t\t\n\t\t\t\t\t", "eNewsletter Signup", "Shop", "Advertise", "News & Analysis", "All Topics", "Patient Safety", "Quality Improvement", "Medication Safety", "Infection Control", "Patients as Partners", "Accreditation & Regulation", "Technology", "Risk Management", "Team Training", "Leadership", "Workplace Safety", "Environment and Facilities", "ACA", "Population Health", "COVID-19", "Caregiver Burnout", "Workplace Conflicts", "Magazine", "Current Issue", "Subscriber Services", "Archives", "Podcasts", "Resources", "All Resources", "Webinars", "Videos", "Whitepapers", "Forms & Tools", "IP Week", "PS Week", "Events", "Career Center", "Forums", "About", "Mission Statement", "Editorial Advisory Board", "Authors", "Partners", "Sponsorship", "Contact", "Privacy Policy", "PSQH", "April 2017 study", "October 2016 ", " story", "Advertise Here", "our new podcast", "Facebook", "Twitter", "About Us", "Sponsorship", "Contact Us", "By Scott Mace", "As emergency rooms see long lines and post-discharge patients roam hallways, dedicated space for transitional care is once again on the minds of many care quality advocates.", "One such advocate is Marvina Williams, RN, senior medical planner and senior associate at Perkins+Will, an architecture and design firm active in the design of post-discharge spaces. The University Health System (UHS) of San Antonio, one of those spaces, was implemented when UHS built a sky tower as part of its University Hospital expansion and renovation.", "As part of the planning process, Perkins+Will officials met with the employees who would use the space, particularly nurses and nursing leadership and technical staff, Williams says. As a nurse and a Lean Black Belt, she gathered information about best practices around the country to inform the design of the discharge lounge. “Discharge lounges have been around for years,” she says. “However, they haven’t always been utilized appropriately, and it was mainly through the staffing.”", "A typical problem is relying upon volunteers to staff the discharge lounge. If the volunteers don’t show up, the discharge lounge can’t provide necessary services to patients. Instead, Perkins+Will recommends adequate staffing.", "In recent years, hospitals have experienced shortages of beds in the ER or in main wards, and so patients back up in the ER, complicating their care, Williams says. Post-surgery patients may be feeling good and ready to be transferred to a bed, but with a shortage of beds, what are hospitals to do?", "“One of the things that they were trying to do is look at ways that they could empty out the beds upstairs, so that they aren’t having these delays in turnaround time for getting patients upstairs in a bed,” Williams says. “One of the ways that can be done is through discharge lounges.”", "UHS did the discharge lounge right, Williams says. “They have it staffed appropriately, which is great, and they have really nice Barcaloungers for the patients to be discharged, because not everybody that’s discharged is still feeling absolutely wonderful.”", "Other amenities in the lounge include oxygen, since so many discharged patients go home on oxygen. Patients can also wait at the lounge for the arrival of durable medical equipment. Hospital officials say UHS is considering opening up a second lounge for additional capacity given the success of its existing lounge, Williams says.", "Discharge lounges also serve as a gathering point for patients waiting for rides, as well as for family members waiting for patients, further relieving the chaos of having discharged patients scattered throughout the hospital, she says.", "UHS’ lounge also includes a kiosk where patients can receive their medications at the time of discharge. “They can even talk to the pharmacist about their medications, if need be,” Williams says. In an ", "April 2017 study", " by the journal ", "Patient Preference and Adherence,", " patients with low and intermediate medication adherence had an adjusted 2.54-fold higher odds of readmission compared to patients with high adherence.", "As former director of a large trauma center, Williams knows well the pain of having an overloaded ER. “At one time I had 43 admissions waiting for beds upstairs,” she says. “If you do that, you have locked down your ER, not being able to turn your regular ER patients through. Same thing with the operating room. If your recovery area is totally booked because you can’t place these patients, it affects your surgeries. So it is a big issue in a lot of hospitals, and the discharge lounges seem to be working if they are staffed appropriately.”", "The comfortable seating in a post-discharge center can also be a much better patient experience for those waiting to be seen in the ER. “When I worked in the emergency room, the one thing that drove me crazy was to see someone on an ER stretcher for eight hours,” Williams says. “It’s a hard stretcher, so lots of times we would try to even get a hospital bed down that we could put them on, if we knew that they were admitted.” Still, the goal, particularly on the part of nurses, is always to open up the beds upstairs—hence the encouragement of prompt check-out, moving patients to the post-discharge center.", "UHS is monitoring this churn time as one way of evaluating the effectiveness of its discharge lounge, Williams says.", "In addition, care transitions have been identified as a heavy influence on readmission rates. As described in the ", "October 2016 ", "PSQH", " story", ", “Exploring Post-Discharge Spaces Designed to Eliminate Gaps in Care,” more health systems are looking at creating spaces that let discharged patients easily access the information and resources they need while they’re still at the hospital or near their clinical team.", "Deciding how to appropriately staff a post-discharge center depends upon the size of the lounge and the needs of the patients who will be using it, Williams says. “Many patients that are being put in discharge lounges are healthy or they’re getting better, but then there are some patients that have chronic conditions and are going to be discharged home but need some kind of support,” she says. “Those patients may need a little bit more looking over or care for, but usually there’s space for a family member to be in the lounge too to help them out, because they basically have been discharged from the hospital.”", "Minimum staffing for a post-discharge center generally includes a nurse or two acting as dedicated post-discharge coaches, plus one or two tech staffers, Williams says. The nurses can also answer questions about medications the discharged patients may be receiving from the kiosk, although at UHS, the kiosk can also connect patients directly to pharmacists via two-way video conferencing.", "Some hospitals have experimented with recommending that patients “check out” for discharge by noon, much like a hotel, in order to help prepare that bed for a new patient, but having a discharge lounge can make it more likely patients will follow those recommendations, Williams says. “They’re just trying to be able to have something that staff could then utilize to move these patients down once they’re discharged and then to make that bed ready for the next patient,” she says.", "“Mondays are one of the worst days in hospitals, especially emergency rooms,” Williams continues. “They’re one of the busiest days, because people have waited. Maybe they’ve been sick all weekend, and waited until their family doctor opens up. They can’t get appointments, so they end up coming to the emergency room or whatever, and then that’s one of your highest admission days.”", "Another potential use for discharge lounges is to accommodate discharged patients affiliated with nursing homes, Williams says. “Many times they’ll get transported to the hospital a few hours early before whatever procedure they’re going to have, and then they wait and then they get the procedure, and then they have to wait a few more hours for rides back. They could be placed in one of these spaces while they wait.”", "As the move to improve patient experience and outcomes continues, expect post-discharge facilities to continue to find a role to play.", "Scott Mace is a contributing writer to ", "PSQH.", "Be the Expert! Share this:", "Effective immediately, ", "PSQH ", "will no longer publish print magazine issues due to a number of factors. We will continue to provide daily patient safety and quality news and analysis on our website, as well as provide insight via various innovative formats such as podcasts, webinars, and virtual events. Thank you for your continued interest.", "Check out ", "our new podcast", " for insight and analysis about the latest patient safety and quality issues!", "eNewsletter Signup", "Shop", "Advertise", "News & Analysis", "\n", "\n\t", "All Topics", "\n\t", "Patient Safety", "\n\t", "Quality Improvement", "\n\t", "Medication Safety", "\n\t", "Infection Control", "\n\t", "Patients as Partners", "\n\t", "Accreditation & Regulation", "\n\t", "Technology", "\n\t", "Risk Management", "\n\t", "Team Training", "\n\t", "Leadership", "\n\t", "Workplace Safety", "\n\t", "Environment and Facilities", "\n\t", "ACA", "\n\t", "Population Health", "\n\t", "COVID-19", "\n\t", "Caregiver Burnout", "\n\t", "Workplace Conflicts", "\n", "\n", "Magazine", "\n", "\n\t", "Current Issue", "\n\t", "Subscriber Services", "\n\t", "Archives", "\n", "\n", "Podcasts", "Resources", "\n", "\n\t", "All Resources", "\n\t", "Webinars", "\n\t", "Videos", "\n\t", "Whitepapers", "\n\t", "Forms & Tools", "\n\t", "IP Week", "\n\t", "PS Week", "\n", "\n", "Events", "Career Center", "Forums", "About", "\n", "\n\t", "Mission Statement", "\n\t", "Editorial Advisory Board", "\n\t", "Authors", "\n\t", "Partners", "\n\t", "Sponsorship", "\n\t", "Contact", "\n\t", "Privacy Policy", "\n", "\n", "\n\t\t", "\n\t", "\n\t\tAnalyses\t", "\n\t\tEnvironment and Facilities\t", "Facebook", "Twitter", "About Us", "Sponsorship", "Contact Us", "ie=edge", "width=device-width, initial-scale=1", "index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1", "en_US", "article", "Transitional Care Gets a Room of Its Own - Patient Safety & Quality Healthcare", "As emergency rooms see long lines and post-discharge patients roam hallways, dedicated space for transitional care is once again on the minds of many care quality advocates.", "https://www.psqh.com/analysis/transitional-care-gets-room/", "Patient Safety & Quality Healthcare", "2017-07-12T15:34:11+00:00", "https://www.psqh.com//app/uploads/2017/07/Headley-cover_web.jpg", "summary", "Est. reading time", "6 minutes", "www.pages02.net,codingbooks.com,credentialingresourcecenter.com,decisionhealth.com,epharm5.com,exchanges.healthleadersmedia.com,hcmarketplace.com,hcpro.com,healthleadersmedia.com,hospitalsafetycenter.com,justcoding.com,longtermcarebillers.com,medicarecompliancewatch.com,medicarefind.com,nahri.org,pages.argosy.group,patientsafetymonitor.com,psqh.com,revenuecycleadvisor.com,store.decisionhealth.com,strategiesfornursemanagers.com,www.credentialingresourcecenter.com,www.healthleadersmedia.com"]}