{"text": ["Python: parsing PDF text and tables - usage and comparison of pdfminer, tabula and pdfplumber", "s", "Home", "Blogs", "Post a blog", "Home", "Python", "Python", "Java", "Android", "Linux", "Python", "MySQL", "Programming", "Javascript", "Database", "Big Data", "Oracle", "iOS", "Java", "Python", "Linux", "Algorithm", "Javascript", "Spring", "data structure", "C++", "MySQL", "Design Pattern", "Front-end", "Database", "fatalerrors.org", "Pdf is an exceptional pitfall. There are many libraries dealing with pdf, but they are not perfect. I. pdfminer3k pdfminer3k is the python 3 version of pdfminer, which is mainly used to read the text in pdf. There are many examples of pdfminer3k c...", "Pdf is an exceptional pitfall. There are many libraries dealing with pdf, but they are not perfect.", "pdfminer3k is the python 3 version of pdfminer, which is mainly used to read the text in pdf.", "There are many examples of pdfminer3k code on the Internet. After reading it, I just want to talk about it. It's too complicated to violate the conciseness of python.", " ", " ", "pdfminer is very unfriendly to table processing. It can extract text, but it has no format:", "pdf form screenshot:", "Code run results:", " ", "It's not easy to restore this result to a table. Too many rules will inevitably lead to a decline in versatility.", " ", "Tabulula is designed to extract PDF table data, while supporting PDF export to CSV, Excel format, but this tool is written in java, depending on Java 7/8. tabula-py is a layer of python encapsulation, so it also relies on Java 7/8.", "The code is simple:", "Although it is said to be specialized in processing tables in pdf, the actual effect is not so good. Or the PDF used in pdfminer. The results are as follows:", "This result is really awkward. The header recognition is wrong. There are two tables in the pdf. I don't find how to distinguish the tables.", " ", "Pdf plus is a page-by-page processing of pdf, which can obtain all the text of the page, and provides a separate method for extracting tables.", "The resulting table is a two-dimensional array of string type, which is shown in line output for comparison with tabula.", "As you can see, compared with tabula, first of all, it can distinguish tables, secondly, the accuracy has been improved a lot, and the recognition of the header is completely correct. For those with line breaks in the table, the recognition is not very correct, but at least the partition of columns is not a problem, so it can be handled.", "After treatment, the operation results are as follows:", "This result is absolutely correct, and with tabula, even after processing, it is impossible to get such a result. Of course, different PDFs may need different processing, but the actual situation still needs to be analyzed by oneself.", "Pdf plus also has inaccurate processing, mainly in the absence of columns:", "I found another pdf. The screenshot of the table is as follows:", "The analytical results are as follows:", "Four columns become two columns. In addition, if the table has merged cells, there will be such a problem. I chose this table to show because it is special, and no merged cells are missing. This should be related to the generation of pdf.", "But in fact, the data is complete, not lost, but is considered to be non-tabular. The output page.extract_text() is as follows:", " ", "Then I tried it with tabula, and the results are as follows:", "The list is all, but what about the header?", " ", "Pdfplus also provides a graphics Debug function, which can get the screenshots of PDF pages, and use boxes to identify text or tables to help judge the recognition of PDF, and adjust the configuration. To use this feature, you also need to install Image Magick. Because it was not used, so I did not go into details for the time being.", " ", "When we do crawler, we will inevitably encounter PDF need to parse, mainly for text and table data extraction. And python has too many libraries to deal with pdf, such as pypdf2, and there are too many materials on the internet, but I tried to read it out as scrambled code, without careful reading of the source code, so this problem has not been solved.", "But after comparing the three libraries commonly used, I think that PDF plus is better to use and the support for tables is the best.", "\n            Posted by ", "gdlwx", "\n                        in ", "Python", "\n                        at ", "Dec 04, 2018 - 12:41 AM", "\n                    ", "\n            ", "Java", "\n                            ", "× 321", "\n                    ", "\n            ", "Android", "\n                            ", "× 221", "\n                    ", "\n            ", "Linux", "\n                            ", "× 182", "\n                    ", "\n            ", "Python", "\n                            ", "× 111", "\n                    ", "\n            ", "MySQL", "\n                            ", "× 103", "\n                    ", "\n            ", "Programming", "\n                            ", "× 101", "\n                    ", "\n            ", "Javascript", "\n                            ", "× 98", "\n                    ", "\n            ", "Database", "\n                            ", "× 52", "\n                    ", "\n            ", "Big Data", "\n                            ", "× 45", "\n                    ", "\n            ", "Oracle", "\n                            ", "× 45", "\n                    ", "\n            ", "iOS", "\n                            ", "× 43", "\n                    ", "\n                ", "Java", "\n                                    ", "× 5747", "\n                            ", "\n                ", "Python", "\n                                    ", "× 2242", "\n                            ", "\n                ", "Linux", "\n                                    ", "× 1283", "\n                            ", "\n                ", "Algorithm", "\n                                    ", "× 1229", "\n                            ", "\n                ", "Javascript", "\n                                    ", "× 1227", "\n                            ", "\n                ", "Spring", "\n                                    ", "× 1009", "\n                            ", "\n                ", "data structure", "\n                                    ", "× 895", "\n                            ", "\n                ", "C++", "\n                                    ", "× 819", "\n                            ", "\n                ", "MySQL", "\n                                    ", "× 766", "\n                            ", "\n                ", "Design Pattern", "\n                                    ", "× 712", "\n                            ", "\n                ", "Front-end", "\n                                    ", "× 650", "\n                            ", "\n                ", "Database", "\n                                    ", "× 641", "\n                            ", "Python,table,IT,this,import,object,processing,can,CODE,test,Java,File,string,list,csv,RE,here,strip,Excel,layer,encapsulation,encoding,index,array,new,debug,function,Configuration,image,Go,crawler,source code", "Pdf is an exceptional pitfall. There are many libraries dealing with pdf, but they are not perfect. I. pdfminer3k pdfminer3k is the python 3 version of pdfminer, which is mainly used to read the text in pdf. There are many examples of pdfminer3k c...", "width=device-width, initial-scale=1.0"]}