{"text": [" Arts vs. Athletics: Two Great Ways You Can Prepare for College and ...  | CollegeXpress", "Login", "sign up", "College Search", "Graduate Program Search", "Scholarship Search", "Lists & Rankings", "Business", "Campus Visits", "Catholic Colleges and Universities", "Christian Colleges and Universities", "College Admission", "College Athletics", "College Diversity", "Counselors and Consultants", "Education and Teaching", "Financial Aid", "Graduate School", "Health and Medicine", "International Students", "Internships and Careers", "Majors and Academics", "Parents", "Performing and Visual Arts", "Public Colleges and Universities", "Science and Engineering", "Student Life", "Test Prep", "Transfer Students", "Contact Us", "Why CollegeXpress", "FAQs", "$10,000 Scholarship", "CollegeXpress Store", "Corporate Website", "Terms of Use", "Privacy Policy", "CA Privacy Policy", "College Search ", "Search by kewords, location, and more", "Get matched by interests", "Search by lists and rankings", "Get started with our guide", "Graduate Program Search »", "Yes, connect me!", "Michigan State University", "\n                  ", "Yes, connect me!", "The University of Scranton", "\n                  ", "Yes, connect me!", "Johns Hopkins University", "\n                  ", "Yes, connect me!", "Biola University", "\n                  ", "Scholarship Search ", "Search by keywords and academic filters", "Search by categories", "View all featured scholarships", "Learn more about financial aid", "$1,000 Christian College EDGE Scholarship", "$2,500 Christian College Scholarship Drawing", "Carnegie Dartlet $10,000 Scholarship", "ScholarshipPoints $10,000 Scholarship", "Lists & Rankings ", "Browse majors lists", "Browse student life lists", "Browse college costs lists", "Browse all lists", "The Top 20 Private Colleges for Community Service", "10 Colleges That Get Greek Life Right", "Men's Division I Basketball Champions and Runners-Up", "Choices for Jewish Students", "Articles & Advice ", "College Admission", "Financial Aid", "Student Life", "Browse all categories", "When Finances Change While Your Student Is in College", "Why Model UN Is the Perfect High School Extracurricular", "Top Tips for Good Grades in High School and College", "How to Find the Right Health Sciences Field for You", "Articles & Advice", "Student Life", "Articles", "CollegeXpress", "Bookmark", "Join Now", "arts", "athletics", "college arts", "college athletics", "intramurals", "music", "performing and visual arts", "performing arts", "soccer", "sports", "student life", "theater", "visual arts", "Join CollegeXpress", "Carnegie Mellon University", "Yes, connect me!", "See another featured school", "Dominican University of California ", "Yes, connect me!", "See another featured school", "Southwestern Assemblies of God University", "Yes, connect me!", "See another featured school", "Lasell University", "Yes, connect me!", "See another featured school", "Quinnipiac University", "Yes, connect me!", "See another featured school", "See All Matches", "Contact Us", "Why CollegeXpress", "FAQs", "$10,000 Scholarship", "Corporate Website", "Racial Justice Initiatives", "College Search", "Scholarship Search", "Lists and Rankings", "Graduate Program Search", "Articles & Advice", "College Admission", "Financial Aid", "College Athletics", "Test Prep", "Internships and Careers", "More Subjects ", "All Interests", "Campus Visits", "Student Life", "Ask the Experts", "Health and Medicine", "Performing and Visual Arts", "Science and Engineering", "Business", "Catholic Colleges and Universities", "Christian Colleges and Universities", "College Diversity", "Education and Teaching", "International Students", "Public Colleges and Universities", "Transfer Students", "CollegeXpress Store", "Digital Magazines", "Counselors & IECs", "College Planning Checklist", "Become a Brand Ambassador", "Affiliates & Partnerships", "More Resources ", "Parents", "SAT Word Game", "SAT & ACT Date Wheel", "Contributor Guidelines", "Student Writer Guidelines", "Social Networks", "The Amazing College Fact Machine", "Free College Widgets", "College Data Updates", "Scholarship Providers", "Carnegie Dartlet", "Terms of Use", "Privacy Policy", "CA Privacy Policy", "Do Not Sell My Info", "CollegeXpress", "Though they may not seem like essential parts of preparing for college, playing sports and participating in artistic endeavors cultivate distinct, very...", "Login", " or ", "sign up", " to be automatically entered into our next $10,000 scholarship giveaway", "Michigan State University", "\n                  ", "East Lansing, MI", "The University of Scranton", "\n                  ", "Scranton, PA", "Johns Hopkins University", "\n                  ", "Baltimore, MD", "Biola University", "\n                  ", "La Mirada, CA", "$1,000 Christian College EDGE Scholarship", "$2,500 Christian College Scholarship Drawing", "Carnegie Dartlet $10,000 Scholarship", "ScholarshipPoints $10,000 Scholarship", "The Top 20 Private Colleges for Community Service", "10 Colleges That Get Greek Life Right", "Men's Division I Basketball Champions and Runners-Up", "Choices for Jewish Students", "When Finances Change While Your Student Is in College", "Why Model UN Is the Perfect High School Extracurricular", "Top Tips for Good Grades in High School and College", "How to Find the Right Health Sciences Field for You", "Articles & Advice", " > ", "Student Life", " > ", "Articles", "Though they may not seem like essential parts of preparing for college, playing sports and participating in artistic endeavors cultivate distinct, very different strengths. ", "by ", "CollegeXpress", " ", "\n      Originally Posted: Apr 11, 2014", "\n      Last Updated: Sep 22, 2017\n    ", "The jocks and the artsy kids: the players on the field and the players on the stage, the ones throwing perfect spirals and the ones throwing clay pots. They’re common high school stereotypes, archetypes, whatever you want to call them.", "It always seems like their worlds don’t intersect. And, truly, it can be really hard to find time for soccer practice ", "and", " dance team rehearsals when you also have homework, part-time jobs, and, you know, a social life. They can be demanding, time-consuming hobbies, and maybe that’s a big reason why we see jocks and artsy kids living on opposite sides of the spectrum in the first place.", "Though they may not seem like essential parts of preparing for college, playing sports and participating in artistic endeavors cultivate distinct, very different strengths. And you develop skills not just useful on a college application but well into your adult life. So don’t be afraid to pursue your interests in either, and if you can make time for them both, then do both! It’s in your best interest to try.", "Here on the CollegeXpress staff, we happen to have two such high school archetypes: a drama geek and a multi-sport athlete. We decided to discuss our own experiences in arts and athletics, and the skills they cultivate. (Now, if only we could combine our brains, we’d have the perfect well-rounded student!)", "One of my earliest memories of playing sports was when I was about five years old in one of those funny little kid soccer games. To paint the picture for you, I was the one on the field picking daffodils as the ball passed by me. I admit, it wasn’t my most stellar moment as an athlete, but it was where it all started.", "They always say that practice makes perfect, and I couldn’t agree more. Being an athlete is all about being better each day, building upon what you did well (or not so well) in that last game. I actually had a coach who would write each player a note after games and tell us what needed work the next time we hit the field. My response to her critique was setting up drills in my backyard on the weekends and working even harder during practice to focus on those problem areas. I do my best to never make the same mistake twice. However, that first mistake is always a catalyst to accomplishing more and being better.", "As an athlete, you have to have thick skin to receive criticism if you didn’t make that one play or let that goal sneak by you. Outside of athletics and in the business world, I’m appreciative to have had that experience early on, as I was conditioned to know that a critique is a means of someone telling you that they know you can do better. When I started working in the CollegeXpress scholarship database, my manager will would always push to have a few more awards added or a few more edited than what I had initially done. Today, we are close to 20,000 (awesome, I might add) scholarships and it was because I was pushed beyond my comfort zone.", "The skill of time management has become synonymous with the student-athlete. With daily practices after school, games, and group bonding outings, to do well in school on top of each of those is like walking a tight rope, juggling five classes, homework, tests, and even a (small) social life. I was once told that there are no excuses to not be able to do the work you have chosen to take on; you have to keep your hands in different pots and always be stirring. Deadlines need to be met, communication with clients needs to be taken care of, and general tasks need to be completed, somehow while a billion other things are going on.", "I’ll admit it: I’m not the most social person you’ll ever meet. However, being on a team requires communication. Much like being on the field, every employee is in a position they excel at to propel a company forward. As you yell to let a teammate know you’re there to receive a pass, you let your coworkers know when you need help or to simply keep them up-to-date on what you’re doing so they in turn can complete what they need to. Without good communication and teamwork, the whole thing breaks down. But with it? You become unbeatable.", "My grandmother took me to see my first performance, a ballet called ", "Copelia", ", when I was eight years old. I was already a pretty dramatic child, and after seeing that show, I wanted to be on stage pretty much from that moment on. Of course, I had all the grace and coordination of a stuck pig, so ballet was out. But I loved singing and acting, and was a choir geek/theater nerd to the core. Not so surprisingly, I also enjoyed other creative pursuits, like writing, painting, and craftwork. That’s why I’m so thankful I get to delve into many of these interests, writing and planning unique, creative (I hope!) content for our magazines and websites.", "Chiefly among the skills fostered by the arts is, of course, creativity. That same ability that helps you see the sculpture in a pile of clay also fosters an ability to look at problems from new and innovative angles. Out in the “real world,” if an idea isn’t really working for you (or not working for whomever you’re reporting to), you can tap into your creative instincts to try things a different way. In my own life, when I’m developing the articles you read on CollegeXpress and in our magazines, I often need to cover similar topics year after year: campus visits, financial aid, etc.—it’s just the nature of the college search cycle. But I try to approach these topics in new ways, so our readers can benefit from our site, whether it’s their first visit or their 50", "th", ".", "Besides the creativity inherent in the arts, you can also develop stronger interpersonal and professional skills. For example, the experience of performing in a live show can help prepare you for future public speaking engagements—even if that’s just speaking up in a company meeting. Head up, shoulders back, say what you need to say! You also get accustomed to rehearsing what you have to say, a handy skill when it comes to preparing for job interview questions.", "What about the visual arts? Communicating your emotions through a work of art is pretty different from sharing your opinion in a boardroom, right? Well, there’s more straightforward communication to the arts than you might think. It’s actually pretty rare for artists to ", "avoid", " discussing their work. They might write artists’ statements or brief descriptions of their work, and they may simply discuss their techniques at length in an academic setting. My soon-to-be sister-in-law is an absurdly talented ceramic artist, and as an artist-in-residence, she has given lectures and even had people watch her throughout the day—reality TV style—as she creates and talks about her work! Needless to say, she knows how to talk to a room and to clearly express herself.  ", "You might not think there are many similarities between the two, but artists and athletes do share several foundational skills. And they’re skills from which you undoubtedly benefit as a college student and a working professional in any field.", "You develop time management skills that come from juggling a busy schedule, whether it’s fitting in football practice or rehearsals for the spring musical. You gain confidence, whether it comes after displaying a painting in a competition or scoring a goal. Both are competitive fields, whether you’re gunning for the All-State team or the All-State choir. Time management and organizational skills? A confident, positive outlook? A healthy sense of competition and ambition? These things are hiring managers’ dream qualifications. ", "And, if we might get a little sentimental for a minute, you can’t discount the pure joy you get from doing something you love. Life is tough sometimes, and personal happiness takes work. Engaging in these activities, artistic or sporty, even just for fun, can make for an all-around happier you. And that’s worth the time and effort alone.", "TL;DR: Arts vs. athletics? Nah, more like arts + athletics. Getting involved with either (and, if you can, both!) is sure to help you in your college and career goals.", "Join the CollegeXpress community! Create a free account and\n        we’ll notify you about new articles, scholarship deadlines, and more. ", "CollegeXpress has everything you need to simplify your college search, get connected to schools, and find your perfect fit.", "$", "10,000", "Register now for our scholarship giveaway", "\n          Pittsburgh,\n          PA\n        ", "\n          San Rafael,\n          CA\n        ", "\n          Waxahachie,\n          TX\n        ", "\n          Newton,\n          MA\n        ", "\n          Hamden,\n          CT\n        ", "Copyright © 2021 ", "Carnegie Dartlet", ". All rights reserved.", " ", "Terms of Use", " | ", "Privacy Policy", " | ", "CA Privacy Policy", " | ", "Do Not Sell My Info", "Directory Data is copyrighted material under license to ", "CollegeXpress", " and which is reproduced by permission of CollegeXpress. All rights reserved.", "College Search", "Graduate Program Search", "Scholarship Search", "Lists & Rankings", "Business", "Campus Visits", "Catholic Colleges and Universities", "Christian Colleges and Universities", "College Admission", "College Athletics", "College Diversity", "Counselors and Consultants", "Education and Teaching", "Financial Aid", "Graduate School", "Health and Medicine", "International Students", "Internships and Careers", "Majors and Academics", "Parents", "Performing and Visual Arts", "Public Colleges and Universities", "Science and Engineering", "Student Life", "Test Prep", "Transfer Students", "Contact Us", "Why CollegeXpress", "FAQs", "$10,000 Scholarship", "CollegeXpress Store", "Corporate Website", "Terms of Use", "Privacy Policy", "CA Privacy Policy", "College Search ", " ▾", "\n          ", "\n            ", "\n              ", "\n                ", "\n                  ", "\n                    ", "Search by kewords, location, and more", "\n                    ", "Get matched by interests", "\n                    ", "Search by lists and rankings", "\n                    ", "Get started with our guide", "\n                    ", "Graduate Program Search »", "\n                  ", "\n                ", "\n\n                \n                ", "\n                  ", "\n                    ", "\n                    ", "\n                    ", "\n                    ", "\n                    \n  ", "\n      ", "\n  ", "\n\n                  ", "\n                  ", "\n                  \n    ", "Yes, connect me!", "\n\n                  ", "Michigan State University", "\n                  ", "East Lansing, MI", "\n                ", "\n                \n                ", "\n                  ", "\n                    ", "\n                    ", "\n                    ", "\n                    ", "\n                    \n  ", "\n      ", "\n  ", "\n\n                  ", "\n                  ", "\n                  \n    ", "Yes, connect me!", "\n\n                  ", "The University of Scranton", "\n                  ", "Scranton, PA", "\n                ", "\n                \n                ", "\n                  ", "\n                    ", "\n                    ", "\n                    ", "\n                    ", "\n                    \n  ", "\n      ", "\n  ", "\n\n                  ", "\n                  ", "\n                  \n    ", "Yes, connect me!", "\n\n                  ", "Johns Hopkins University", "\n                  ", "Baltimore, MD", "\n                ", "\n                \n                ", "\n                  ", "\n                    ", "\n                    ", "\n                    ", "\n                    ", "\n                    \n  ", "\n      ", "\n  ", "\n\n                  ", "\n                  ", "\n                  \n    ", "Yes, connect me!", "\n\n                  ", "Biola University", "\n                  ", "La Mirada, CA", "\n                ", "\n                \n\n              ", "\n            ", "\n          ", "\n         ", "Scholarship Search ", " ▾", "\n          ", "\n              ", "\n                ", "\n                  ", "\n                    ", "\n                      ", "Search by keywords and academic filters", "\n                      ", "Search by categories", "\n                      ", "View all featured scholarships", "\n                      ", "Learn more about financial aid", "\n                    ", "\n                  ", "\n\n                  \n                  ", "\n                    ", "\n                    ", "$1,000 Christian College EDGE Scholarship", "\n                  ", "\n                  \n                  ", "\n                    ", "\n                    ", "$2,500 Christian College Scholarship Drawing", "\n                  ", "\n                  \n                  ", "\n                    ", "\n                    ", "Carnegie Dartlet $10,000 Scholarship", "\n                  ", "\n                  \n                  ", "\n                    ", "\n                    ", "ScholarshipPoints $10,000 Scholarship", "\n                  ", "\n                  \n\n                ", "\n              ", "\n          ", "\n         ", "Lists & Rankings ", " ▾", "\n          ", "\n            ", "\n              ", "\n                ", "\n                  ", "\n                    ", "Browse majors lists", "\n                    ", "Browse student life lists", "\n                    ", "Browse college costs lists", "\n                    ", "Browse all lists", "\n                  ", "\n                ", "\n\n                \n                ", "\n                  ", "\n                  ", "The Top 20 Private Colleges for Community Service", "\n                ", "\n                \n                ", "\n                  ", "\n                  ", "10 Colleges That Get Greek Life Right", "\n                ", "\n                \n                ", "\n                  ", "\n                  ", "Men's Division I Basketball Champions and Runners-Up", "\n                ", "\n                \n                ", "\n                  ", "\n                  ", "Choices for Jewish Students", "\n                ", "\n                \n\n              ", "\n            ", "\n          ", "\n         ", "Articles & Advice ", " ▾", "\n          ", "\n            ", "\n              ", "\n                ", "\n                  ", "\n                    ", "College Admission", "\n                    ", "Financial Aid", "\n                    ", "Student Life", "\n                    ", "Browse all categories", "\n                  ", "\n                ", "\n\n                \n                ", "\n                  ", "\n                  ", "When Finances Change While Your Student Is in College", "\n                ", "\n                \n                ", "\n                  ", "\n                  ", "Why Model UN Is the Perfect High School Extracurricular", "\n                ", "\n                \n                ", "\n                  ", "\n                  ", "Top Tips for Good Grades in High School and College", "\n                ", "\n                \n                ", "\n                  ", "\n                  ", "How to Find the Right Health Sciences Field for You", "\n                ", "\n                \n\n              ", "\n            ", "\n          ", "\n         ", " ", "The Best College Extracurriculars to Strengthen Your Resume", " ", "Where and How to Find Free Events in College", " ", "College Organizations and Activities Worth Getting Excited Over", " ", "The Ultimate Study Abroad Timeline", " ", "What You Need to Consider Before Studying Abroad", "Basics", "Contact Us", "Why CollegeXpress", "FAQs", "$10,000 Scholarship", "Corporate Website", "Racial Justice Initiatives", "Tools", "College Search", "Scholarship Search", "Lists and Rankings", "Graduate Program Search", "Articles & Advice", "Expert Advice", "College Admission", "Financial Aid", "College Athletics", "Test Prep", "Internships and Careers", "All Interests", "Campus Visits", "Student Life", "Ask the Experts", "Health and Medicine", "Performing and Visual Arts", "Science and Engineering", "Business", "Catholic Colleges and Universities", "Christian Colleges and Universities", "College Diversity", "Education and Teaching", "International Students", "Public Colleges and Universities", "Transfer Students", "Other Resources", "CollegeXpress Store", "Digital Magazines", "Counselors & IECs", "College Planning Checklist", "Become a Brand Ambassador", "Affiliates & Partnerships", "Parents", "SAT Word Game", "SAT & ACT Date Wheel", "Contributor Guidelines", "Student Writer Guidelines", "Social Networks", "The Amazing College Fact Machine", "Free College Widgets", "College Data Updates", "Scholarship Providers", "IE=edge,chrome=1", "Though they may not seem like essential parts of preparing for college, playing sports and participating in artistic endeavors cultivate distinct, very...", "width=device-width", "GExkMwQh5LWW08NlIlPvsqrkTPCDo_R0xmon-nIxvTI", "779A18E20FAE69DEDE733CD8900C0B92", "3d728217-a0da-4ac0-b7b0-c8ff229143ee", "summary", "@CollegeXpress", "@CollegeXpress", "1629768883936625", "article", "Arts vs. Athletics: Two Great Ways You Can Prepare for College and for Life ", "https://images.collegexpress.com/article/arts-athletics.jpg", "Though they may not seem like essential parts of preparing for college, playing sports and participating in artistic endeavors cultivate distinct, very different strengths.  Search Thousands Of Colleges And Scholarships. Join Our Growing Community Of College Bound Students.", "https://www.collegexpress.com/articles-and-advice/student-life/articles/student-activities/arts-vs-sports-two-great-ways-you-can-prepare-college-and-life/", "#ffffff", "/static/img/ms-icon-144x144.png", "#ffffff"]}